; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v5 ?v7)
             (pred_12 ?v2 ?v6)
             (pred_2 ?v5 ?v6)
             (pred_1 ?v11 ?v5 )
	     (pred_6 ?v5)
             (pred_10 ?v8)
             (pred_9 ?v2)
             (pred_4 ?v6)
             (pred_5 ?v5)
             (pred_8 ?v2)
             (pred_3 ?v5)
             (pred_7 ))



(:action op_4
:parameters (?v3 ?v4 ?v10 ?v13)
:precondition (and (pred_10 ?v3) (pred_10 ?v4) (pred_9 ?v10) (pred_4 ?v13)
          (pred_11 ?v3 ?v4) (pred_12 ?v10 ?v13)
                   (pred_2 ?v4 ?v13) (pred_6 ?v3) 
                   (pred_5 ?v4) (pred_8 ?v10))
:effect (and  (pred_3 ?v4) (not (pred_5 ?v4))))


(:action op_3
:parameters (?v3 ?v12)
:precondition (and (pred_10 ?v3) (pred_10 ?v12)
               (pred_6 ?v3) (pred_11 ?v3 ?v12) (pred_3 ?v12))
:effect (and (pred_6 ?v12) (not (pred_6 ?v3))))

(:action op_5
:parameters (?v3 ?v10)
:precondition (and (pred_10 ?v3) (pred_9 ?v10) 
                  (pred_6 ?v3) (pred_1 ?v10 ?v3) (pred_7 ))
:effect (and (pred_8 ?v10)
   (not (pred_1 ?v10 ?v3)) (not (pred_7 ))))


(:action op_2
:parameters (?v3 ?v1 ?v9)
:precondition (and (pred_10 ?v3) (pred_9 ?v1) (pred_9 ?v9)
                  (pred_6 ?v3) (pred_8 ?v9) (pred_1 ?v1 ?v3))
:effect (and (pred_8 ?v1) (pred_1 ?v9 ?v3)
        (not (pred_8 ?v9)) (not (pred_1 ?v1 ?v3))))

(:action op_1
:parameters (?v3 ?v10)
:precondition (and (pred_10 ?v3) (pred_9 ?v10) 
                  (pred_6 ?v3) (pred_8 ?v10))
:effect (and (pred_7 ) (pred_1 ?v10 ?v3) (not (pred_8 ?v10)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_30 obj_24 obj_31 obj_20 obj_08 obj_12 obj_21 obj_04 obj_05 obj_15 obj_16 obj_27 obj_22 obj_26 obj_10 obj_19 obj_06 obj_09 obj_28 obj_17 obj_02 obj_25 obj_01 obj_07 obj_03
    obj_18 obj_13 obj_14
    obj_29 obj_23 obj_11
    )

    (:init
       (pred_7)

       (pred_10 obj_30)
       (pred_10 obj_24)
       (pred_10 obj_31)
       (pred_10 obj_20)
       (pred_10 obj_08)
       (pred_10 obj_12)
       (pred_10 obj_21)
       (pred_10 obj_04)
       (pred_10 obj_05)
       (pred_10 obj_15)
       (pred_10 obj_16)
       (pred_10 obj_27)
       (pred_10 obj_22)
       (pred_10 obj_26)
       (pred_10 obj_10)
       (pred_10 obj_19)
       (pred_10 obj_06)
       (pred_10 obj_09)
       (pred_10 obj_28)
       (pred_10 obj_17)
       (pred_10 obj_02)
       (pred_10 obj_25)
       (pred_10 obj_01)
       (pred_10 obj_07)
       (pred_10 obj_03)
       (pred_4 obj_18)
       (pred_4 obj_13)
       (pred_4 obj_14)
       (pred_9 obj_29)
       (pred_9 obj_23)
       (pred_9 obj_11)

       (pred_11 obj_30 obj_12)
       (pred_11 obj_30 obj_24)
       (pred_11 obj_24 obj_21)
       (pred_11 obj_24 obj_31)
       (pred_11 obj_24 obj_30)
       (pred_11 obj_31 obj_04)
       (pred_11 obj_31 obj_20)
       (pred_11 obj_31 obj_24)
       (pred_11 obj_20 obj_05)
       (pred_11 obj_20 obj_08)
       (pred_11 obj_20 obj_31)
       (pred_11 obj_08 obj_15)
       (pred_11 obj_08 obj_20)
       (pred_11 obj_12 obj_16)
       (pred_11 obj_12 obj_21)
       (pred_11 obj_12 obj_30)
       (pred_11 obj_21 obj_27)
       (pred_11 obj_21 obj_04)
       (pred_11 obj_21 obj_24)
       (pred_11 obj_21 obj_12)
       (pred_11 obj_04 obj_22)
       (pred_11 obj_04 obj_05)
       (pred_11 obj_04 obj_31)
       (pred_11 obj_04 obj_21)
       (pred_11 obj_05 obj_26)
       (pred_11 obj_05 obj_15)
       (pred_11 obj_05 obj_20)
       (pred_11 obj_05 obj_04)
       (pred_11 obj_15 obj_10)
       (pred_11 obj_15 obj_08)
       (pred_11 obj_15 obj_05)
       (pred_11 obj_16 obj_19)
       (pred_11 obj_16 obj_27)
       (pred_11 obj_16 obj_12)
       (pred_11 obj_27 obj_06)
       (pred_11 obj_27 obj_22)
       (pred_11 obj_27 obj_21)
       (pred_11 obj_27 obj_16)
       (pred_11 obj_22 obj_09)
       (pred_11 obj_22 obj_26)
       (pred_11 obj_22 obj_04)
       (pred_11 obj_22 obj_27)
       (pred_11 obj_26 obj_28)
       (pred_11 obj_26 obj_10)
       (pred_11 obj_26 obj_05)
       (pred_11 obj_26 obj_22)
       (pred_11 obj_10 obj_17)
       (pred_11 obj_10 obj_15)
       (pred_11 obj_10 obj_26)
       (pred_11 obj_19 obj_02)
       (pred_11 obj_19 obj_06)
       (pred_11 obj_19 obj_16)
       (pred_11 obj_06 obj_25)
       (pred_11 obj_06 obj_09)
       (pred_11 obj_06 obj_27)
       (pred_11 obj_06 obj_19)
       (pred_11 obj_09 obj_01)
       (pred_11 obj_09 obj_28)
       (pred_11 obj_09 obj_22)
       (pred_11 obj_09 obj_06)
       (pred_11 obj_28 obj_07)
       (pred_11 obj_28 obj_17)
       (pred_11 obj_28 obj_26)
       (pred_11 obj_28 obj_09)
       (pred_11 obj_17 obj_03)
       (pred_11 obj_17 obj_10)
       (pred_11 obj_17 obj_28)
       (pred_11 obj_02 obj_25)
       (pred_11 obj_02 obj_19)
       (pred_11 obj_25 obj_01)
       (pred_11 obj_25 obj_06)
       (pred_11 obj_25 obj_02)
       (pred_11 obj_01 obj_07)
       (pred_11 obj_01 obj_09)
       (pred_11 obj_01 obj_25)
       (pred_11 obj_07 obj_03)
       (pred_11 obj_07 obj_28)
       (pred_11 obj_07 obj_01)
       (pred_11 obj_03 obj_17)
       (pred_11 obj_03 obj_07)
       (pred_5 obj_08)
       (pred_5 obj_02)
       (pred_5 obj_04)
       (pred_2  obj_08 obj_18)
       (pred_2  obj_02 obj_13)
       (pred_2  obj_04 obj_14)
       (pred_3 obj_30)
       (pred_3 obj_24)
       (pred_3 obj_31)
       (pred_3 obj_20)
       (pred_3 obj_12)
       (pred_3 obj_21)
       (pred_3 obj_05)
       (pred_3 obj_15)
       (pred_3 obj_16)
       (pred_3 obj_27)
       (pred_3 obj_22)
       (pred_3 obj_26)
       (pred_3 obj_10)
       (pred_3 obj_19)
       (pred_3 obj_06)
       (pred_3 obj_09)
       (pred_3 obj_28)
       (pred_3 obj_17)
       (pred_3 obj_25)
       (pred_3 obj_01)
       (pred_3 obj_07)
       (pred_3 obj_03)

       (pred_12  obj_29 obj_18)
       (pred_12  obj_23 obj_13)
       (pred_12  obj_11 obj_14)
       (pred_1 obj_29 obj_19)
       (pred_1 obj_23 obj_04)
       (pred_1 obj_11 obj_21)
       (pred_6 obj_10)
    )

    (:goal (and
       (pred_1 obj_29 obj_24)
    ))
(:constraints
  (always (not (pred_6 obj_16)))
)
)

; plan
1. (op_3 obj_10 obj_17)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_17)
   goals met: 0 of 1
2. (op_3 obj_17 obj_28)
   deleted: (pred_6 obj_17)
   added: (pred_6 obj_28)
   goals met: 0 of 1
3. (op_3 obj_28 obj_09)
   deleted: (pred_6 obj_28)
   added: (pred_6 obj_09)
   goals met: 0 of 1
4. (op_3 obj_09 obj_06)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_06)
   goals met: 0 of 1
5. (op_3 obj_06 obj_19)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_19)
   goals met: 0 of 1
6. (op_5 obj_19 obj_29)
   deleted: (pred_1 obj_29 obj_19) (pred_7)
   added: (pred_8 obj_29)
   goals met: 0 of 1
7. (op_3 obj_19 obj_06)
   deleted: (pred_6 obj_19)
   added: (pred_6 obj_06)
   goals met: 0 of 1
8. (op_3 obj_06 obj_27)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_27)
   goals met: 0 of 1
9. (op_3 obj_27 obj_21)
   deleted: (pred_6 obj_27)
   added: (pred_6 obj_21)
   goals met: 0 of 1
10. (op_3 obj_21 obj_24)
   deleted: (pred_6 obj_21)
   added: (pred_6 obj_24)
   goals met: 0 of 1
11. (op_1 obj_24 obj_29)
   deleted: (pred_8 obj_29)
   added: (pred_7) (pred_1 obj_29 obj_24)
   goals met: 1 of 1
